import Link from "next/link";

const EmptyCart = () => {
  return(
    <>
      <div className="empty-cart">
        <svg width="221" height="221" viewBox="0 0 221 221" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M5 5H28.4444L33.1333 28.4444L5 5ZM51.8889 122.222H169.111L216 28.4444H33.1333L51.8889 122.222ZM51.8889 122.222L33.1333 28.4444L51.8889 122.222ZM51.8889 122.222L25.0098 149.101C17.6248 156.486 22.8529 169.111 33.2974 169.111H169.111L51.8889 122.222ZM169.111 169.111C162.893 169.111 156.93 171.581 152.533 175.978C148.137 180.375 145.667 186.338 145.667 192.556C145.667 198.773 148.137 204.737 152.533 209.133C156.93 213.53 162.893 216 169.111 216C175.329 216 181.292 213.53 185.689 209.133C190.086 204.737 192.556 198.773 192.556 192.556C192.556 186.338 190.086 180.375 185.689 175.978C181.292 171.581 175.329 169.111 169.111 169.111ZM75.3333 192.556C75.3333 198.773 72.8633 204.737 68.4666 209.133C64.0699 213.53 58.1067 216 51.8889 216C45.671 216 39.7078 213.53 35.3112 209.133C30.9145 204.737 28.4444 198.773 28.4444 192.556C28.4444 186.338 30.9145 180.375 35.3112 175.978C39.7078 171.581 45.671 169.111 51.8889 169.111C58.1067 169.111 64.0699 171.581 68.4666 175.978C72.8633 180.375 75.3333 186.338 75.3333 192.556V192.556Z" stroke="#4862D2" strokeOpacity="0.2" strokeWidth="10" strokeLinecap="round" strokeLinejoin="round"/>
        </svg>
        <p className="empty-cart__title">Ваша корзина пуста</p>
        <p className="empty-cart__subtitle">Перейдите на <Link href="/"><a>главную страницу</a></Link> что бы продолжить покупки</p>

      </div>


      <style jsx>{`
         .empty-cart{
           margin-top:14rem;
           text-align:center;
         }

         .empty-cart__title{
            font-weight: 600;
            font-size: 36px;
            color: #CACACA;
            margin-bottom:1.5rem;
         }

         .empty-cart__subtitle{
            font-weight: 600;
            font-size: 14px;
            color: #424242;
         }

         .empty-cart__subtitle a{
           color: #4862D2;
         }
      `}</style>
    </>
  )
}

export default EmptyCart;
